In [126]:
import pandas as pd 
import numpy as np 
import os 
print(os.getcwd())

c:\Users\FURKANN\Desktop\PythonForDataScience

In [127]:
data= pd.Series([1, 3, 5, np.nan, 6, 8])
data

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [128]:
pd.Series([1, 3, 5, np.nan, 6, 8],index=list("abcdef"))

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

In [129]:
dates=pd.date_range(start="01-01-2000",end="13-01-2000",periods=6)
dates

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-03 09:36:00',
               '2000-01-05 19:12:00', '2000-01-08 04:48:00',
               '2000-01-10 14:24:00', '2000-01-13 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [130]:
date_data=pd.DataFrame(np.random.randint(10,50,16).reshape(4,4),index=pd.date_range(start="01-01-2025",end="13-01-2025",periods=4),columns=list("ABCD"))
date_data

             A   B   C   D
2025-01-01  30  30  26  42
2025-01-05  24  17  21  18
2025-01-09  27  21  27  31
2025-01-13  34  46  48  26

In [ ]:
array = date_data.to_numpy()  #index haric verileri verir 
array

array([[24, 17, 21, 18, 11],
       [27, 21, 27, 31, 11],
       [34, 46, 48, 26, 11],
       [25, 35, 45, 20, 11]])

In [185]:
date_data.sort_values("B")

                      A   B   C   D  new_column
2025-01-05 00:00:00  24  17  21  18          11
2025-01-09 00:00:00  27  21  27  31          11
2025-01-01           25  35  45  20          11
2025-01-13 00:00:00  34  46  48  26          11

In [ ]:
date_data[date_data["B"]>20]   #B SÜTUNUNUN 20 DEN BÜYÜK OLDUĞU YERLER

                      A   B   C   D  new_column
2025-01-09 00:00:00  27  21  27  31          11
2025-01-13 00:00:00  34  46  48  26          11
2025-01-01           25  35  45  20          11

In [187]:
date_data.value_counts()

A   B   C   D   new_column
24  17  21  18  11            1
25  35  45  20  11            1
27  21  27  31  11            1
34  46  48  26  11            1
Name: count, dtype: int64

In [ ]:
date_data.stack()  #sütun sayısını azaltarak gösterir

2025-01-05 00:00:00  A             24
                     B             17
                     C             21
                     D             18
                     new_column    11
2025-01-09 00:00:00  A             27
                     B             21
                     C             27
                     D             31
                     new_column    11
2025-01-13 00:00:00  A             34
                     B             46
                     C             48
                     D             26
                     new_column    11
2025-01-01           A             25
                     B             35
                     C             45
                     D             20
                     new_column    11
dtype: int64

In [131]:
date_data["C"]

2025-01-01    26
2025-01-05    21
2025-01-09    27
2025-01-13    48
Name: C, dtype: int32

In [132]:
date_data[["A","B"]]

             A   B
2025-01-01  30  30
2025-01-05  24  17
2025-01-09  27  21
2025-01-13  34  46

In [ ]:
date_data.loc["2025-01-01"]     #satır secimi loc ve iloc ile yapılır

A    30
B    30
C    26
D    42
Name: 2025-01-01 00:00:00, dtype: int32

In [134]:
date_data.iloc[0]

A    30
B    30
C    26
D    42
Name: 2025-01-01 00:00:00, dtype: int32

In [135]:
date_data.iloc[0:3]

             A   B   C   D
2025-01-01  30  30  26  42
2025-01-05  24  17  21  18
2025-01-09  27  21  27  31

In [136]:
date_data.iloc[0:3,0:2]       #[satır:satır,sütun:sütun]

             A   B
2025-01-01  30  30
2025-01-05  24  17
2025-01-09  27  21

In [ ]:
date_data["new_column"]=11  
date_data

             A   B   C   D  new_column
2025-01-01  30  30  26  42          11
2025-01-05  24  17  21  18          11
2025-01-09  27  21  27  31          11
2025-01-13  34  46  48  26          11

In [138]:
date_data.drop("new_column",axis=1)   #inplace true yapmazsak date_data da hala new_column var olmaya devam eder

             A   B   C   D
2025-01-01  30  30  26  42
2025-01-05  24  17  21  18
2025-01-09  27  21  27  31
2025-01-13  34  46  48  26

In [139]:
date_data.drop("2025-01-01",axis=0,inplace=True) #2. kez calistirirsak hata aliriz cünkü verilen satir yok

In [140]:
date_data

             A   B   C   D  new_column
2025-01-05  24  17  21  18          11
2025-01-09  27  21  27  31          11
2025-01-13  34  46  48  26          11

In [141]:
new_row=pd.DataFrame([[25, 35, 45, 20,11]],columns=["A", "B", "C", "D","new_column"],index=["2025-01-01"])
date_data=pd.concat([date_data, new_row])
date_data

                      A   B   C   D  new_column
2025-01-05 00:00:00  24  17  21  18          11
2025-01-09 00:00:00  27  21  27  31          11
2025-01-13 00:00:00  34  46  48  26          11
2025-01-01           25  35  45  20          11

In [142]:
date_data[date_data["B"]>13]

                      A   B   C   D  new_column
2025-01-05 00:00:00  24  17  21  18          11
2025-01-09 00:00:00  27  21  27  31          11
2025-01-13 00:00:00  34  46  48  26          11
2025-01-01           25  35  45  20          11

In [143]:
date_data.reset_index()

                 index   A   B   C   D  new_column
0  2025-01-05 00:00:00  24  17  21  18          11
1  2025-01-09 00:00:00  27  21  27  31          11
2  2025-01-13 00:00:00  34  46  48  26          11
3           2025-01-01  25  35  45  20          11

In [144]:
date_data

                      A   B   C   D  new_column
2025-01-05 00:00:00  24  17  21  18          11
2025-01-09 00:00:00  27  21  27  31          11
2025-01-13 00:00:00  34  46  48  26          11
2025-01-01           25  35  45  20          11

In [145]:
datas=np.random.random(24).reshape(6,4)
new_df=pd.DataFrame(data=datas,index=["Furkan","Can","Sevim","Umay","Gökçe","Almila"],columns=["Salary","performance","prim","mesai"])
new_df

          Salary  performance      prim     mesai
Furkan  0.361493     0.180523  0.388595  0.931475
Can     0.376576     0.261639  0.850146  0.239640
Sevim   0.197277     0.718761  0.992489  0.958984
Umay    0.014649     0.680436  0.434623  0.657047
Gökçe   0.801820     0.419564  0.782228  0.198637
Almila  0.695964     0.629893  0.999288  0.167563

In [146]:
gruplar=["Yönetim","Yönetim","Yönetim","Calisan","Calisan","Calisan"]
new_df.index=pd.MultiIndex.from_arrays([gruplar,new_df.index],names=["görev","isim"])
new_df

                  Salary  performance      prim     mesai
görev   isim
Yönetim Furkan  0.361493     0.180523  0.388595  0.931475
        Can     0.376576     0.261639  0.850146  0.239640
        Sevim   0.197277     0.718761  0.992489  0.958984
Calisan Umay    0.014649     0.680436  0.434623  0.657047
        Gökçe   0.801820     0.419564  0.782228  0.198637
        Almila  0.695964     0.629893  0.999288  0.167563

In [147]:
new_df.index = new_df.index.droplevel("görev")
new_df

          Salary  performance      prim     mesai
isim
Furkan  0.361493     0.180523  0.388595  0.931475
Can     0.376576     0.261639  0.850146  0.239640
Sevim   0.197277     0.718761  0.992489  0.958984
Umay    0.014649     0.680436  0.434623  0.657047
Gökçe   0.801820     0.419564  0.782228  0.198637
Almila  0.695964     0.629893  0.999288  0.167563

In [148]:
outer_index=["Yönetim","Yönetim","Yönetim","Calisan","Calisan","Calisan"]
first_index=["Furkan","Can","Sevim","Umay","Gökçe","Almila"]
zipped_index=list(zip(outer_index,first_index))
zipped_index=pd.MultiIndex.from_tuples(zipped_index)
new_df=pd.DataFrame(data=datas,index=zipped_index,columns=["Salary","performance","prim","mesai"])
new_df

                  Salary  performance      prim     mesai
Yönetim Furkan  0.361493     0.180523  0.388595  0.931475
        Can     0.376576     0.261639  0.850146  0.239640
        Sevim   0.197277     0.718761  0.992489  0.958984
Calisan Umay    0.014649     0.680436  0.434623  0.657047
        Gökçe   0.801820     0.419564  0.782228  0.198637
        Almila  0.695964     0.629893  0.999288  0.167563

In [149]:
new_df.loc["Yönetim"]   #df[yönetim] calısmıyor cünkü MultiIndex kullanıldığında "Yönetim" bir sütun değil, bir index seviyesinin değeridir.
                        #df[yönetim] sütun arar

          Salary  performance      prim     mesai
Furkan  0.361493     0.180523  0.388595  0.931475
Can     0.376576     0.261639  0.850146  0.239640
Sevim   0.197277     0.718761  0.992489  0.958984

In [150]:
new_df.loc["Yönetim"]["prim"]

Furkan    0.388595
Can       0.850146
Sevim     0.992489
Name: prim, dtype: float64

In [151]:
new_df.loc[("Yönetim","Furkan")]

Salary         0.361493
performance    0.180523
prim           0.388595
mesai          0.931475
Name: (Yönetim, Furkan), dtype: float64

In [152]:
employee=pd.read_csv("6-employee.csv")
employee.head(5)

  Department Employee  Salary  Experience           City
0  Marketing    Emp_1   53483           1       New York
1      Sales    Emp_2   78555           8         Austin
2    Finance    Emp_3   47159           3         Austin
3      Sales    Emp_4  110077           3  San Francisco
4      Sales    Emp_5   65920           1       New York

In [153]:
employee.tail(5)

   Department Employee  Salary  Experience           City
45         HR   Emp_46   97563          13  San Francisco
46         IT   Emp_47   32695           3       New York
47      Sales   Emp_48   78190           7         Austin
48         IT   Emp_49   35258           1       New York
49  Marketing   Emp_50  117538           4       New York

In [154]:
employee.describe()

              Salary  Experience
count      50.000000   50.000000
mean    78344.500000    7.060000
std     27817.603904    3.966235
min     31016.000000    1.000000
25%     53687.250000    3.000000
50%     78769.500000    7.000000
75%    100778.000000   10.000000
max    119812.000000   14.000000

In [155]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Department  50 non-null     object
 1   Employee    50 non-null     object
 2   Salary      50 non-null     int64
 3   Experience  50 non-null     int64
 4   City        50 non-null     object
dtypes: int64(2), object(3)
memory usage: 2.1+ KB

In [156]:
employee.isna().head()

   Department  Employee  Salary  Experience   City
0       False     False   False       False  False
1       False     False   False       False  False
2       False     False   False       False  False
3       False     False   False       False  False
4       False     False   False       False  False

In [157]:
employee.dropna().head()

  Department Employee  Salary  Experience           City
0  Marketing    Emp_1   53483           1       New York
1      Sales    Emp_2   78555           8         Austin
2    Finance    Emp_3   47159           3         Austin
3      Sales    Emp_4  110077           3  San Francisco
4      Sales    Emp_5   65920           1       New York

In [158]:
weather=pd.read_excel("6-weather.xlsx", engine="openpyxl")

In [159]:
weather.isna()

   Istanbul  New York  Amsterdam  Paris
0     False     False      False  False
1     False     False      False  False
2     False     False      False  False
3     False     False      False  False
4     False     False      False  False
5     False     False      False  False
6     False     False      False  False
7     False     False      False  False
8     False     False      False  False

In [160]:
weather.dropna()

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [161]:
weather.fillna(20)

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [162]:
weather.count()

Istanbul     9
New York     9
Amsterdam    9
Paris        9
dtype: int64

In [163]:
grouped=employee.groupby("Department")
grouped.count()

            Employee  Salary  Experience  City
Department
Finance           10      10          10    10
HR                 7       7           7     7
IT                10      10          10    10
Marketing         13      13          13    13
Sales             10      10          10    10

In [164]:
grouped["Salary"].mean()

Department
Finance      90552.700000
HR           76182.571429
IT           63381.600000
Marketing    79555.000000
Sales        81038.900000
Name: Salary, dtype: float64

In [165]:
df1=pd.read_csv("7-concat_data1.csv")
df2=pd.read_csv("7-concat_data2.csv")

In [166]:
df2.head(5)

   Employee_ID    Name Department
0           11  Emp_11    Finance
1           12  Emp_12    Finance
2           13  Emp_13    Finance
3           14  Emp_14    Finance
4           15  Emp_15  Marketing

In [167]:
df1.head(5)

   Employee_ID   Name Department
0            1  Emp_1    Finance
1            2  Emp_2  Marketing
2            3  Emp_3         HR
3            4  Emp_4    Finance
4            5  Emp_5    Finance

In [168]:
concat_df=pd.concat([df1,df2],ignore_index=True)
concat_df

    Employee_ID    Name Department
0             1   Emp_1    Finance
1             2   Emp_2  Marketing
2             3   Emp_3         HR
3             4   Emp_4    Finance
4             5   Emp_5    Finance
5             6   Emp_6  Marketing
6             7   Emp_7         HR
7             8   Emp_8         HR
8             9   Emp_9    Finance
9            10  Emp_10         IT
10           11  Emp_11    Finance
11           12  Emp_12    Finance
12           13  Emp_13    Finance
13           14  Emp_14    Finance
14           15  Emp_15  Marketing
15           16  Emp_16         HR
16           17  Emp_17  Marketing
17           18  Emp_18  Marketing
18           19  Emp_19  Marketing
19           20  Emp_20    Finance

In [169]:
merged_df=pd.merge(df1,df2,on="Department",how="inner")
merged_df

    Employee_ID_x Name_x Department  Employee_ID_y  Name_y
0               1  Emp_1    Finance             11  Emp_11
1               1  Emp_1    Finance             12  Emp_12
2               1  Emp_1    Finance             13  Emp_13
3               1  Emp_1    Finance             14  Emp_14
4               1  Emp_1    Finance             20  Emp_20
5               2  Emp_2  Marketing             15  Emp_15
6               2  Emp_2  Marketing             17  Emp_17
7               2  Emp_2  Marketing             18  Emp_18
8               2  Emp_2  Marketing             19  Emp_19
9               3  Emp_3         HR             16  Emp_16
10              4  Emp_4    Finance             11  Emp_11
11              4  Emp_4    Finance             12  Emp_12
12              4  Emp_4    Finance             13  Emp_13
13              4  Emp_4    Finance             14  Emp_14
14              4  Emp_4    Finance             20  Emp_20
15              5  Emp_5    Finance             11  Emp_11
16              5  Emp_5    Finance             12  Emp_12
17              5  Emp_5    Finance             13  Emp_13
18              5  Emp_5    Finance             14  Emp_14
19              5  Emp_5    Finance             20  Emp_20
20              6  Emp_6  Marketing             15  Emp_15
21              6  Emp_6  Marketing             17  Emp_17
22              6  Emp_6  Marketing             18  Emp_18
23              6  Emp_6  Marketing             19  Emp_19
24              7  Emp_7         HR             16  Emp_16
25              8  Emp_8         HR             16  Emp_16
26              9  Emp_9    Finance             11  Emp_11
27              9  Emp_9    Finance             12  Emp_12
28              9  Emp_9    Finance             13  Emp_13
29              9  Emp_9    Finance             14  Emp_14
30              9  Emp_9    Finance             20  Emp_20

In [170]:
merged_df=pd.merge(df1,df2,on="Department",how="left")
merged_df

    Employee_ID_x  Name_x Department  Employee_ID_y  Name_y
0               1   Emp_1    Finance           11.0  Emp_11
1               1   Emp_1    Finance           12.0  Emp_12
2               1   Emp_1    Finance           13.0  Emp_13
3               1   Emp_1    Finance           14.0  Emp_14
4               1   Emp_1    Finance           20.0  Emp_20
5               2   Emp_2  Marketing           15.0  Emp_15
6               2   Emp_2  Marketing           17.0  Emp_17
7               2   Emp_2  Marketing           18.0  Emp_18
8               2   Emp_2  Marketing           19.0  Emp_19
9               3   Emp_3         HR           16.0  Emp_16
10              4   Emp_4    Finance           11.0  Emp_11
11              4   Emp_4    Finance           12.0  Emp_12
12              4   Emp_4    Finance           13.0  Emp_13
13              4   Emp_4    Finance           14.0  Emp_14
14              4   Emp_4    Finance           20.0  Emp_20
15              5   Emp_5    Finance           11.0  Emp_11
16              5   Emp_5    Finance           12.0  Emp_12
17              5   Emp_5    Finance           13.0  Emp_13
18              5   Emp_5    Finance           14.0  Emp_14
19              5   Emp_5    Finance           20.0  Emp_20
20              6   Emp_6  Marketing           15.0  Emp_15
21              6   Emp_6  Marketing           17.0  Emp_17
22              6   Emp_6  Marketing           18.0  Emp_18
23              6   Emp_6  Marketing           19.0  Emp_19
24              7   Emp_7         HR           16.0  Emp_16
25              8   Emp_8         HR           16.0  Emp_16
26              9   Emp_9    Finance           11.0  Emp_11
27              9   Emp_9    Finance           12.0  Emp_12
28              9   Emp_9    Finance           13.0  Emp_13
29              9   Emp_9    Finance           14.0  Emp_14
30              9   Emp_9    Finance           20.0  Emp_20
31             10  Emp_10         IT            NaN     NaN

DATAFRAME FUNCTION APPLYING

In [171]:
example_data=pd.read_csv("8-apply_function_data.csv")
example_data.head(5)

   Employee_ID   Name Department  Salary  Experience  Performance_Score
0            1  Emp_1  Marketing   82251           6                  5
1            2  Emp_2      Sales   52662          24                  3
2            3  Emp_3    Finance   38392           5                  3
3            4  Emp_4      Sales   60535          20                  3
4            5  Emp_5      Sales  108603           2                  2

In [172]:
example_data.describe()

       Employee_ID         Salary  Experience  Performance_Score
count   100.000000     100.000000  100.000000          100.00000
mean     50.500000   77508.090000   12.090000            3.03000
std      29.011492   26083.327596    7.543939            1.41746
min       1.000000   30206.000000    1.000000            1.00000
25%      25.750000   54347.500000    5.000000            2.00000
50%      50.500000   80932.000000   12.000000            3.00000
75%      75.250000   97620.500000   19.000000            4.00000
max     100.000000  119474.000000   24.000000            5.00000

In [173]:
example_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        100 non-null    int64
 1   Name               100 non-null    object
 2   Department         100 non-null    object
 3   Salary             100 non-null    int64
 4   Experience         100 non-null    int64
 5   Performance_Score  100 non-null    int64
dtypes: int64(4), object(2)
memory usage: 4.8+ KB

In [174]:
def salary_class(salary):
    if salary< 50000:
        return "poor"
    if salary<80000:
        return "middle"
    else:
        return "rich"

example_data["salary_class"]=example_data["Salary"].apply(salary_class)
example_data

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,salary_class
0,1,Emp_1,Marketing,82251,6,5,rich
1,2,Emp_2,Sales,52662,24,3,middle
2,3,Emp_3,Finance,38392,5,3,poor
3,4,Emp_4,Sales,60535,20,3,middle
4,5,Emp_5,Sales,108603,2,2,rich
...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,rich
96,97,Emp_97,Sales,100467,22,2,rich
97,98,Emp_98,IT,82662,23,3,rich
98,99,Emp_99,IT,42688,22,1,poor
99,100,Emp_100,HR,55342,14,3,middle

In [175]:
def potential_ceo(row):
    if (row["Experience"] >15  and row["Performance_Score"]>4):    #ceo secimi icin kriter
        return "potential ceo"
    else:
        return"not potential ceo"

example_data["can_be_ceo"]=example_data.apply(potential_ceo,axis=1)
example_data

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,salary_class,can_be_ceo
0,1,Emp_1,Marketing,82251,6,5,rich,not potential ceo
1,2,Emp_2,Sales,52662,24,3,middle,not potential ceo
2,3,Emp_3,Finance,38392,5,3,poor,not potential ceo
3,4,Emp_4,Sales,60535,20,3,middle,not potential ceo
4,5,Emp_5,Sales,108603,2,2,rich,not potential ceo
...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,rich,not potential ceo
96,97,Emp_97,Sales,100467,22,2,rich,not potential ceo
97,98,Emp_98,IT,82662,23,3,rich,not potential ceo
98,99,Emp_99,IT,42688,22,1,poor,not potential ceo
99,100,Emp_100,HR,55342,14,3,middle,not potential ceo

In [182]:
example_data[example_data["can_be_ceo"]!="not potential ceo"]       #potansiyel ceo olabilecek ksisileri gösterir

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,salary_class,can_be_ceo,NEW_Salary
9,10,Emp_10,Sales,109575,16,5,rich,potential ceo,191756.25
19,20,Emp_20,Marketing,112948,19,5,rich,potential ceo,197659.00
20,21,Emp_21,IT,36910,20,5,poor,potential ceo,64592.50
27,28,Emp_28,IT,84268,18,5,rich,potential ceo,147469.00
32,33,Emp_33,Marketing,86044,23,5,rich,potential ceo,150577.00
51,52,Emp_52,Marketing,56105,16,5,middle,potential ceo,98183.75
57,58,Emp_58,IT,60080,24,5,middle,potential ceo,105140.00
62,63,Emp_63,Sales,39474,17,5,poor,potential ceo,69079.50
73,74,Emp_74,IT,84384,18,5,rich,potential ceo,147672.00
87,88,Emp_88,HR,68623,24,5,middle,potential ceo,120090.25
93,94,Emp_94,Finance,56309,16,5,middle,potential ceo,98540.75

In [ ]:
def salary_update(row):
    if (row["Experience"] >10 and row["Performance_Score"]>=4):
        return row["Salary"]*1.75
    else:
        return row["Salary"]
example_data["NEW_Salary"]=example_data.apply(salary_update,axis=1)  #axis 1 belirtilmezse hata verir...
example_data                                                       #yapılan islemi yeni bir sütun olusturarak gösterdik

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,salary_class,can_be_ceo,NEW_Salary
0,1,Emp_1,Marketing,82251,6,5,rich,not potential ceo,82251.0
1,2,Emp_2,Sales,52662,24,3,middle,not potential ceo,52662.0
2,3,Emp_3,Finance,38392,5,3,poor,not potential ceo,38392.0
3,4,Emp_4,Sales,60535,20,3,middle,not potential ceo,60535.0
4,5,Emp_5,Sales,108603,2,2,rich,not potential ceo,108603.0
...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,rich,not potential ceo,164034.5
96,97,Emp_97,Sales,100467,22,2,rich,not potential ceo,100467.0
97,98,Emp_98,IT,82662,23,3,rich,not potential ceo,82662.0
98,99,Emp_99,IT,42688,22,1,poor,not potential ceo,42688.0
99,100,Emp_100,HR,55342,14,3,middle,not potential ceo,55342.0